{"pageProps":{"htmlString":"\n## Bash Script Tool Kit 🛠\n\n![Banner](https://res.cloudinary.com/practicaldev/image/fetch/s--8Jv9KS----/c_imagga_scale,f_auto,fl_progressive,h_420,q_auto,w_1000/https://thepracticaldev.s3.amazonaws.com/i/4n4gq7l7gxosv6uqj9il.jpeg)\n\nIn my blog [Write A Bash Script 101](https://dev.to/jimmymcbride/write-a-bash-script-101-4n2p), I write about how to make a simple bash script from scratch. The purpose of this blog is to serve as a reference (or tool kit) of different bash commands, that you can use as you start creating new bash scripts, and to help open the door of endless possibilities of productivity the world of bash scripts has to offer.\n\n### Pushd And Popd\n\nI go over pushd and popd in [this blog](https://dev.to/jimmymcbride/bash-alias-2og6) about aliases. Aliases are a great way to basically _write one line bash scripts_, so I recommend checking it out if you are unfamiliar with bash aliases. Pushd and popd offer an alternative to cd that has a history you can pop backward through. Although, it's doesn't have to completely replace cd.\n\nSay you're in `~/Downloads` directory and you `pushd ~/Documents/projects/my-project` and then you want to go back to just the projects directory. If you use `popd` then it will take you back to the Downloads directory, so if you want to go to projects directory you have 2 choices:\n\n- `pushd ~/Documents/projects` We have to use an **absolute path** here because we don't have a way to just move up a directory. **Pro** you keep the pushd history going. **Con** you have to type a little more.\n- `cd ..` You move out of the directory into the parent directory. **Pro** easy to type. **Con** you break the `pushd` history chain.\n\n> Note: If you have an alias for the projects directory because you use it so often, when you're in your actual project folder you can just type the alias for that projects directory to bring you back and keep the pushd history chain going without typing the whole **absolute path**.\n\n### Absolute vs Relative Paths\n\nIf you're in your projects directory and you `cd my-project/` or `pushd my-project` you are typing a **relative path**. A relative path is a path that is relative to the current directory you are in.\n\nAn **absolute path** would look like; `cd ~/Documents/projects/my-project/` or `pushd ~/Documents/projects/my-project/`. This will take you to your my-projects directory no matter where you are in your filesystem, which can be really powerful when used in bash scripts.\n\n### Variables\n\nVariables are in many coding languages. In bash, variables are usually named in all caps and a \\$ is called in front to let bash know it's a variable.\n\n#### Declaring a variable\n\nThe typical syntax for declaring a variable:\n\n```bash\nNAME=\"Jimmy McBride\"\n```\n\nNow if you were to save that to your .bashrc file and reload your terminal and type in `echo \"$NAME\"` it should return \"Jimmy McBride\".\n\n#### Bash variables\n\nBash comes with a few variables already that you can use. Here are some I use the most:\n\n- $PATH: returns to you all the paths to bin folders you can use to put your bash scripts in.\n- $HOME: returns to you your home route. Usually looks like `home/username`\n- $USERNAME: returns your username.\n- $PWD: returns your Present Working Directory\n- $1, $2, etc: When you type the name of your bash script it runs the file. You can also type in extra arguments. If you do \\$1 becomes the first argument you typed after the name of your script and so on.\n\n#### Example: File name -> new-project\n\n```bash\n#!/bin/bash\n\n# Push to projects directory with an absolute path\npushd ~/Documents/projects\n\n# Run create-react-app in projects directory\nyarn create react-app \"$1\"\n\n# Move inside the new project folder with a relative path\npushd \"$1\"\n\n# Open project in VS Code\ncode .\n\n# Start server\nyarn start\n```\n\nHere we can type `new-project my-project` and it will create a new react app with the name of our first argument ('my-project' in this case) and then move inside that directory, open the project in VS Code and start the server.\n\nSince we used an absolute path at the beginning of our script, it will take us to the projects directory from anywhere in our file system, where we use this command and run create-react-app in the appropriate directory. We only need to use a relative path to move inside the project directory because we are already in the folder we need to be in.\n\n### Copy or Move Files and Directories\n\nSyntax for moving files:\n\n```bash\nmv <target> <destination>\n# or\nmv <target> <target> <destination>\n\n# Examples\n\n# Moves file1 into folder1\nmv file1 folder1\n\n# Moves file1 and file2 into folder1\nmv file1 file2 folder1\n\n# Moves folder1 and file1 into folder2\nmv folder1 file2 folder1\n```\n\nThe syntax for copying files and folders is:\n\n```bash\ncp <target> <destination>\n\n# Copies file1 into folder1\ncp file1 folder1\n\n# If you want to copy an empty folder somewhere:\ncp folder1 folder2\n\n# If the folder is not empty, you want to copy it recursively:\ncp -r folder1 folder2\n```\n\n### Conclusion\n\nThese are just a few of the many tools bash has to offer when writing your scripts. I've found that I see myself using these commands the most. As I learn more and get better at writing bash script I will update this blog so be sure to add it to your reading list! What are some of your favorite bash commands you use? I would love to hear your thoughts and opinions in the comments below!\n","data":{"title":"Bash Script Tool Kit","image":"https://res.cloudinary.com/practicaldev/image/fetch/s--8Jv9KS----/c_imagga_scale,f_auto,fl_progressive,h_420,q_auto,w_1000/https://thepracticaldev.s3.amazonaws.com/i/4n4gq7l7gxosv6uqj9il.jpeg","description":"The purpose of this blog is to serve as a reference (or tool kit) of different bash commands, that you can use as you start creating new bash scripts, and to help open the door of endless possibilities of productivity the world of bash scripts has to offer."}},"__N_SSG":true}